Autodesk.Revit.DB.IntersectionResult.EdgeParameter
Parameter of a point on the edge closest to the point of intersection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult.EdgeObject
Edge of the face close to the point of intersection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult.Distance
Distance from the original object to located point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult.Parameter
1d parameter of the point of intersection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult.UVPoint
2d (or two 1d) parameters of the point of intersection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult.XYZPoint
Point of intersection in local 3d coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown in the getter when this property has not been set by the method providing the result.

Autodesk.Revit.DB.IntersectionResult
This class captures results of intersecting geometric entities. "Intersecting" is meant
in generalized sense, so the same class will be used for projection, containment, etc.
Refer to the documentation of the method providing the result for the precise meaning of properties.